# Rebar Bar Type Set Auto Calculated Crank Method

Source: https://www.revitapidocs.com/2026/442b027e-7264-159e-e2ec-75f6b890db32.htm

---

| Rebar Bar Type Set Auto Calculated Crank Method |
| --- |

Sets if the crank dimensions are auto calculated or not for the specified Rebar Crank Type.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void SetAutoCalculatedCrank(
	ElementId rebarCrankTypeId,
	bool autoCalculated
)
```

```
Public Sub SetAutoCalculatedCrank (
	rebarCrankTypeId As ElementId,
	autoCalculated As Boolean
)
```

```
public:
void SetAutoCalculatedCrank(
	ElementId^ rebarCrankTypeId,
	bool autoCalculated
)
```

```
member SetAutoCalculatedCrank :
        rebarCrankTypeId : ElementId *
        autoCalculated : bool -> unit
```

#### Parameters

rebarCrankTypeId ElementId
:   The Rebar Crank Type id.
 Interactions with Rebar Crank Types can be done with the functions in \[!:Autodesk::Revit::DB::Structure::RebarCrankTypeUtils] .

autoCalculated Boolean
:   True, if the crank dimensions are auto calculated, false otherwise.

Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | The rebarCrankTypeId doesn't represent a valid Rebar Crank Type. It should be an ElementType of BuiltInCategory.OST\_RebarCrankType category. |
| ArgumentNullException | A non\-optional argument was null |

See Also

#### Reference

RebarBarType Class Autodesk.Revit.DB.Structure Namespace